config/AccumulationRegisters/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакуп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаРозн</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/AccumulationRegisters/ПартииЖНВЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииЖНВЛС</Name>
			<Comment>Учет по партиям товаров</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Колво</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСЗакуп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/CommonModules/ОМ13_Серверный_ОстаткиТоваров/Ext/Module.bsl
#Если Сервер Тогда
	Функция ОМ13_ПолучитьОстаткиПоСписку_дляЗаказа(ДоВыбДок,СписокТоваровТекстом,ВыбПоставщик,ВыбСклад)	Экспорт
		//Назначение
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ЗаказПоставщикуОстатки.Товар КАК Товар,
		               |	ЗаказПоставщикуОстатки.ДатаЗаказа КАК ДатаЗаказа,
		               |	СУММА(ЗаказПоставщикуОстатки.КоличествоОстаток) КАК КолвоОстаток
		               |ИЗ
		               |	РегистрНакопления.ЗаказПоставщику.Остатки(
		               |		&ДоВыбДок,
		               |		Товар В (&СписокТоваров)
		               |			И Поставщик = &ВыбПоставщик и Склад = &ВыбСклад) КАК ЗаказПоставщикуОстатки
		               |ГДЕ
		               |	ЗаказПоставщикуОстатки.КоличествоОстаток > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗаказПоставщикуОстатки.ДатаЗаказа,
		               |	ЗаказПоставщикуОстатки.Товар";
		//,ЗаказПоставщикуОстатки.Поставщик.Ссылка
		//|Having
		//|СУММА(ЗаказПоставщикуОстатки.КоличествоОстаток)>0" ;  И ЗаказПоставщику.Поставщик.Ссылка = &ВыбПоставщик
		Запрос = Новый  Запрос(ТекстЗапроса);
		
		ГДоВД= Новый  Граница(ДоВыбДок,ВидГраницы.Исключая);	
		Запрос.УстановитьПараметр("ДоВыбДок",ГДоВД);
		
		СписокТоваров= Новый СписокЗначений;
		
		СписокТоваров.ЗагрузитьЗначения(ЗначениеИзСтрокиВнутр(СписокТоваровТекстом));
		
		Запрос.УстановитьПараметр("СписокТОВАРОВ",СписокТоваров);
		
		Запрос.УстановитьПараметр("ВыбПоставщик",ВыбПоставщик);
		Запрос.УстановитьПараметр("ВыбСклад",ВыбСклад);
		
		Рез=Запрос.Выполнить();
		ТЗ=Рез.Выгрузить(); // результат запроса в виде ТЗ
		
		Возврат ТЗ;
		
		
	КонецФункции
#КонецЕсли 


#IF Server Then

//============================================================================ GtG ===
Функция ОМ13_ПолучитьОстаткиПоСписку_БезПартий  (ДоВыбДок,СписокТоваровТекстом,ВыбФирма,ВыбСклад) Экспорт
    // Назначение:
	// Получает остатки списка товара по складу
	// в разрезах :
    // ТОвар, серия, ставка ндс
	//--------------------------------------------------------------------------------
	
	
	//----------------------------< ШАБЛОН ЗАПРОСА >--------------------------------GtG--- 
	ТХТ= "ВЫБРАТЬ
	     |	ОстаткиТовараПоСкладамОстатки.Товар.Ссылка as Товар,
	     |	ОстаткиТовараПоСкладамОстатки.Склад.Ссылка as Склад,
	     |	ОстаткиТовараПоСкладамОстатки.СтавкаНДС.Ссылка as СтНДС,
	     |	ОстаткиТовараПоСкладамОстатки.Фирма.Ссылка as Фирма,
	     |	ОстаткиТовараПоСкладамОстатки.Серия.Ссылка as Серия,
	     |	ОстаткиТовараПоСкладамОстатки.Серия.СрокГодности as Срокгодности,
	     |	СУММА(ОстаткиТовараПоСкладамОстатки.КолвоОстаток) КАК КолвоОстаток,
	     |	СУММА(ОстаткиТовараПоСкладамОстатки.СуммаЗакупСНДСОстаток) КАК СуммаЗакупСНДСОстаток,
	     |	СУММА(ОстаткиТовараПоСкладамОстатки.СуммаНДСЗакупОстаток) КАК СуммаНДСЗакупОстаток,
	     |	СУММА(ОстаткиТовараПоСкладамОстатки.СуммаРознСНДСОстаток) КАК СуммаРознСНДСОстаток,
	     |	СУММА(ОстаткиТовараПоСкладамОстатки.СуммаРознНДСОстаток) КАК СуммаРознНДСОстаток
	     |ИЗ
	     |	РегистрНакопления.ОстаткиТовараПоСкладам.Остатки(
	     |		&ДоВыбДок,
	     |		Товар.Ссылка В (&СписокТОВАРОВ)
	     |			И Фирма.Ссылка = &ВыбФирма
	     |			И Склад.Ссылка = &ВыбСклад) КАК ОстаткиТовараПоСкладамОстатки
	    // |Где СУММА(ОстаткиТовараПоСкладамОстатки.КолвоОстаток)>0 
	     |СГРУППИРОВАТЬ ПО
	     |	ОстаткиТовараПоСкладамОстатки.Серия.Ссылка,
	     |	ОстаткиТовараПоСкладамОстатки.СтавкаНДС.Ссылка,
	     |	ОстаткиТовараПоСкладамОстатки.Товар.Ссылка,
	     |	ОстаткиТовараПоСкладамОстатки.Серия.СрокГодности,
	     |	ОстаткиТовараПоСкладамОстатки.Склад.Ссылка,
	     |	ОстаткиТовараПоСкладамОстатки.Фирма.Ссылка
		 |Having
		 |СУММА(ОстаткиТовараПоСкладамОстатки.КолвоОстаток)>0 
		 |ORDER BY
		 |ОстаткиТовараПоСкладамОстатки.Серия.СрокГодности"  ;
	Запрос = Новый  Запрос(ТХТ);
	
	ГДоВД= Новый  Граница(ДоВыбДок,ВидГраницы.Исключая);	
	Запрос.УстановитьПараметр("ДоВыбДок",ГДоВД);
	
	СписокТоваров= Новый СписокЗначений;
	
	СписокТоваров.ЗагрузитьЗначения(ЗначениеИзСтрокиВнутр(СписокТоваровТекстом));
	
	Запрос.УстановитьПараметр("СписокТОВАРОВ",СписокТоваров);

	Запрос.УстановитьПараметр("ВыбФирма",ВыбФирма);

	Запрос.УстановитьПараметр("ВыбСклад",ВыбСклад);

	
	Рез=Запрос.Выполнить();
	ТЗ=Рез.Выгрузить(); // результат запроса в виде ТЗ
	//----------------------------< КОНЕЦ ШАБЛОНА ЗАПРОСА >--------------------------------GtG---
     Возврат ТЗ;
КонецФункции
//============================================================================ GtG ===
#EndIf


#IF Server Then

//============================================================================ GtG ===
Функция ОМ13_ПолучитьОстаткиПоСписку_СПартиями  (ДоВыбДок,СписокТоваровТекстом,ВыбФирма,ВыбСклад) Экспорт
    // Назначение:
	// Получает остатки списка товара по складу
	// в разрезах :
    // ТОвар, серия, ставка ндс
	//--------------------------------------------------------------------------------
	//----------------------------< ШАБЛОН ЗАПРОСА >--------------------------------GtG--- 
	//ТХТ= "ВЫБРАТЬ
	//	 |	ПартииЖНВЛСОстатки.Товар КАК Товар,
	//	 |	ПартииЖНВЛСОстатки.Склад КАК Склад,
	//	 |	ПартииЖНВЛСОстатки.СтавкаНДС КАК СтавкаНДС,
	//	 |	ПартииЖНВЛСОстатки.Партия КАК Партия,
	//	 |	ПартииЖНВЛСОстатки.Фирма КАК Фирма,
	//	 |	СУММА(ПартииЖНВЛСОстатки.КолвоОстаток) КАК КолвоОстаток,
	//	 |	СУММА(ПартииЖНВЛСОстатки.КолвоОстаток) КАК Осталось,
	//	 |	СУММА(ПартииЖНВЛСОстатки.СуммаЗакупСНДСОстаток) КАК СуммаЗакупСНДСОстаток,
	//	 |	СУММА(ПартииЖНВЛСОстатки.СуммаНДСЗакупОстаток) КАК СуммаНДСЗакупОстаток,
	//	 |	СУММА(ПартииЖНВЛСОстатки.СуммаРознСНДСОстаток) КАК СуммаРознСНДСОстаток,
	//	 |	СУММА(ПартииЖНВЛСОстатки.СуммаРознНДСОстаток) КАК СуммаРознНДСОстаток,
	//	 |	ПартииЖНВЛСОстатки.Партия.Серия.СрокГодности КАК ПартияСерияСрокГодности
	//	 |ИЗ
	//	 |	РегистрНакопления.ПартииЖНВЛС.Остатки(
	//	 |		&ДоВыбДок,
	//	 |		Фирма = &ВыбФирма
	//	 |			И Товар В (&СписокТОВАРОВ)
	//	 |			И Склад = &ВыбСклад) КАК ПартииЖНВЛСОстатки
	//	 |
	//	 |СГРУППИРОВАТЬ ПО
	//	 |	ПартииЖНВЛСОстатки.Товар,
	//	 |	ПартииЖНВЛСОстатки.Склад,
	//	 |	ПартииЖНВЛСОстатки.СтавкаНДС,
	//	 |	ПартииЖНВЛСОстатки.Партия,
	//	 |	ПартииЖНВЛСОстатки.Фирма,
	//	 |	ПартииЖНВЛСОстатки.Партия.Серия.СрокГодности
	//	 |
	//	 |ИМЕЮЩИЕ
	//	 |	СУММА(ПартииЖНВЛСОстатки.КолвоОстаток) > 0
	//	 |
	//	 |УПОРЯДОЧИТЬ ПО
	//	 |	ПартияСерияСрокГодности"  ;
		 
	ТХТ="ВЫБРАТЬ
	    |	ПартииЖНВЛСОстатки.Товар КАК Товар,
	    |	ПартииЖНВЛСОстатки.Склад КАК Склад,
	    |	ПартииЖНВЛСОстатки.СтавкаНДС КАК СтавкаНДС,
	    |	ПартииЖНВЛСОстатки.Партия КАК Партия,
	    |	ПартииЖНВЛСОстатки.Фирма КАК Фирма,
	    |	ПартииЖНВЛСОстатки.КолвоОстаток КАК КолвоОстаток,
	    |	ПартииЖНВЛСОстатки.КолвоОстаток КАК Осталось,
	    |	ПартииЖНВЛСОстатки.СуммаЗакупСНДСОстаток КАК СуммаЗакупСНДСОстаток,
	    |	ПартииЖНВЛСОстатки.СуммаНДСЗакупОстаток КАК СуммаНДСЗакупОстаток,
	    |	ПартииЖНВЛСОстатки.СуммаРознСНДСОстаток КАК СуммаРознСНДСОстаток,
	    |	ПартииЖНВЛСОстатки.СуммаРознНДСОстаток КАК СуммаРознНДСОстаток,
	    |	ПартииЖНВЛСОстатки.Партия.СрокГодности КАК ПартияСерияСрокГодности
	    |ИЗ
	    |	РегистрНакопления.ПартииЖНВЛС.Остатки(
	    |			&ДоВыбДок,
	    |			Фирма = &ВыбФирма
	    |				И Товар В (&СписокТОВАРОВ)
	    |				И Склад = &ВыбСклад) КАК ПартииЖНВЛСОстатки
	    |ГДЕ
	    |	ПартииЖНВЛСОстатки.КолвоОстаток > 0
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	ПартияСерияСрокГодности";	 
		 
	Запрос = Новый  Запрос(ТХТ);
	
	ГДоВД= Новый  Граница(ДоВыбДок,ВидГраницы.Исключая);	
	Запрос.УстановитьПараметр("ДоВыбДок",ГДоВД);
	
		
	СписокТоваров= Новый СписокЗначений;
	
	СписокТоваров.ЗагрузитьЗначения(ЗначениеИзСтрокиВнутр(СписокТоваровТекстом));
	
	Запрос.УстановитьПараметр("СписокТОВАРОВ",СписокТоваров);

	Запрос.УстановитьПараметр("ВыбФирма",ВыбФирма);

	Запрос.УстановитьПараметр("ВыбСклад",ВыбСклад);

	
	Рез=Запрос.Выполнить();
	ТЗ=Рез.Выгрузить(); // результат запроса в виде ТЗ
	//----------------------------< КОНЕЦ ШАБЛОНА ЗАПРОСА >--------------------------------GtG---

     Возврат ТЗ;
КонецФункции
//============================================================================ GtG ===
#EndIf
